; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	thermograph2 - mode
	image0 - mode
	thermograph1 - mode
	Star1 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	Star3 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument2 thermograph1)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
)
(:goal (and
	(pointing satellite1 Phenomenon10)
	(have_image Planet6 thermograph1)
	(have_image Planet7 image0)
	(have_image Star8 thermograph2)
	(have_image Planet9 image0)
	(have_image Phenomenon10 thermograph1)
	(have_image Star11 image0)
	(have_image Planet12 thermograph2)
))

)

; plan
1. (turn_to satellite1 groundstation2 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 8
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 8
3. (calibrate satellite1 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 0 of 8
4. (turn_to satellite1 planet6 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet6)
   goals met: 0 of 8
5. (take_image satellite1 planet6 instrument2 thermograph1)
   added: (have_image planet6 thermograph1)
   goals met: 1 of 8
6. (turn_to satellite1 planet12 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet12)
   goals met: 1 of 8
7. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 8
8. (calibrate satellite0 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 1 of 8
9. (take_image satellite1 planet12 instrument2 thermograph2)
   added: (have_image planet12 thermograph2)
   goals met: 2 of 8
10. (turn_to satellite0 planet7 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet7)
   goals met: 2 of 8
11. (take_image satellite0 planet7 instrument1 image0)
   added: (have_image planet7 image0)
   goals met: 3 of 8
12. (turn_to satellite0 planet9 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet9)
   goals met: 3 of 8
13. (take_image satellite0 planet9 instrument1 image0)
   added: (have_image planet9 image0)
   goals met: 4 of 8
14. (turn_to satellite0 star11 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star11)
   goals met: 4 of 8
15. (take_image satellite0 star11 instrument1 image0)
   added: (have_image star11 image0)
   goals met: 5 of 8
16. (turn_to satellite1 star8 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 star8)
   goals met: 5 of 8
17. (take_image satellite1 star8 instrument2 thermograph2)
   added: (have_image star8 thermograph2)
   goals met: 6 of 8
18. (turn_to satellite1 phenomenon10 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 phenomenon10)
   goals met: 7 of 8
19. (take_image satellite1 phenomenon10 instrument2 thermograph1)
   added: (have_image phenomenon10 thermograph1)
   goals met: 8 of 8
